<?php
namespace SWELL_Theme;

// use \SWELL_Theme as SWELL;

defined( 'ABSPATH' ) || exit;

class SVG {

	/**
	 * svgアイコン 出力
	 */
	public static function the_svg( $icon_name, $attrs = [] ) {
		echo self::get_svg( $icon_name, $attrs ); // phpcs:ignore WordPress.Security.EscapeOutput
	}

	/**
	 * svgアイコン 取得
	 */
	public static function get_svg( $icon_name, $attrs = [] ) {
		if ( ! $icon_name ) return '';

		$path     = '';
		$size     = $attrs['size'] ?? '1em' ?: '1em';
		$class    = $attrs['class'] ?? '';
		$view_box = '0 0 48 48';

		switch ( $icon_name ) {
			case 'logo':
				$view_box = '0 0 40 40';
				$path     = '<circle cx="4.2" cy="15.6" r="2.1" />
				<path d="M36.7 11.6c-1-2.2-3.7-3.9-6.9-3.3-3.6.7-5.4 2.9-7.8 5.9-2.7 3.4-5.5 7-9.4 8.5-1.4.6-2.8.8-4.3.8-1.1 0-2.3-.2-3.5-.5-.7-.2-1.5-.5-2.3-.8 2 7.9 9.2 13.8 17.8 13.6 9.8-.2 17.7-8.3 17.7-18-.1-2.1-.4-4.3-1.3-6.2z" />';
				break;
			case 'copy':
				$path = '<path d="M38,5.5h-9c0-2.8-2.2-5-5-5s-5,2.2-5,5h-9c-2.2,0-4,1.8-4,4v33c0,2.2,1.8,4,4,4h28c2.2,0,4-1.8,4-4v-33
				C42,7.3,40.2,5.5,38,5.5z M24,3.5c1.1,0,2,0.9,2,2s-0.9,2-2,2s-2-0.9-2-2S22.9,3.5,24,3.5z M38,42.5H10v-33h5v3c0,0.6,0.4,1,1,1h16
				c0.6,0,1-0.4,1-1v-3h5L38,42.5z"/><polygon points="24,37 32.5,28 27.5,28 27.5,20 20.5,20 20.5,28 15.5,28 "/>';
				break;
			case 'copied':
				$path = '<path d="M38,5.5h-9c0-2.8-2.2-5-5-5s-5,2.2-5,5h-9c-2.2,0-4,1.8-4,4v33c0,2.2,1.8,4,4,4h28c2.2,0,4-1.8,4-4v-33
				C42,7.3,40.2,5.5,38,5.5z M24,3.5c1.1,0,2,0.9,2,2s-0.9,2-2,2s-2-0.9-2-2S22.9,3.5,24,3.5z M38,42.5H10v-33h5v3c0,0.6,0.4,1,1,1h16
				c0.6,0,1-0.4,1-1v-3h5V42.5z"/><polygon points="31.9,20.2 22.1,30.1 17.1,25.1 14.2,28 22.1,35.8 34.8,23.1 "/>';
				break;
			// case 'tax':
			// 	$path = '<path d="M36,14.4V8H20l-3.6-3.4H4v9.8H1.5l1,21h35l1-21H36z M7,7.6h8.2l3.6,3.4H33v3.4H7V7.6z M34.5,32.4h-29l-1-15h31L34.5,32.4z" />';
			// 	break;
			case 'chevronRight':
				$view_box = '0 0 48 48';
				$path     = '<path d="m33 25.1-13.1 13c-.8.8-2 .8-2.8 0-.8-.8-.8-2 0-2.8L28.4 24 17.1 12.7c-.8-.8-.8-2 0-2.8.8-.8 2-.8 2.8 0l13.1 13c.6.6.6 1.6 0 2.2z" />';
				break;
			case 'caretRight':
				$view_box = '0 0 48 48';
				$path     = '<path d="M19.4 38.3 32.7 25c.6-.6.6-1.5 0-2.1L19.4 9.6c-.9-.9-2.6-.3-2.6 1.1v26.5c0 1.4 1.6 2.1 2.6 1.1z" />';
				break;
			case 'arrowCircleRight':
			case 'arrowRightCircle':
				$view_box = '0 0 48 48';
				$path     = '<path d="M24 45C12.4 45 3 35.6 3 24S12.4 3 24 3s21 9.4 21 21-9.4 21-21 21zm0-39C14.1 6 6 14.1 6 24s8.1 18 18 18 18-8.1 18-18S33.9 6 24 6z" /><path d="m34.3 22.9-8.8-8.8c-.6-.6-1.5-.6-2.1 0s-.6 1.5 0 2.1l6.3 6.3H14.8c-.8 0-1.5.7-1.5 1.5s.7 1.5 1.5 1.5h14.8l-6.3 6.3c-.6.6-.6 1.5 0 2.1s1.5.6 2.1 0l8.8-8.8c.7-.6.7-1.6.1-2.2z" />';
				break;
			case 'link':
				$view_box = '0 0 48 48';
				$path     = '<path d="M21.2 30.2c-.5 0-1-.2-1.4-.6l-.7-.7c-2.3-2.3-3.5-5.3-3.5-8.5s1.2-6.2 3.5-8.5l7.1-7.1c2.3-2.3 5.3-3.5 8.5-3.5s6.2 1.2 8.5 3.5c4.7 4.7 4.7 12.3 0 17l-3.5 3.5c-.8.8-2 .8-2.8 0-.8-.8-.8-2 0-2.8l3.5-3.5c3.1-3.1 3.1-8.2 0-11.3-1.5-1.5-3.5-2.3-5.7-2.3-2.1 0-4.2.8-5.7 2.3l-7.1 7.1c-1.5 1.5-2.3 3.5-2.3 5.7s.8 4.2 2.3 5.7l.7.7c.8.8.8 2 0 2.8-.4.3-.9.5-1.4.5z" /><path d="M13.4 46.6c-3.1 0-6.1-1.2-8.5-3.5-2.3-2.3-3.5-5.3-3.5-8.5s1.2-6.2 3.5-8.5l3.5-3.5c.8-.8 2-.8 2.8 0 .8.8.8 2 0 2.8l-3.5 3.5c-1.5 1.5-2.3 3.5-2.3 5.7 0 2.1.8 4.2 2.3 5.7 3.1 3.1 8.2 3.1 11.3 0l7.1-7.1c1.5-1.5 2.3-3.5 2.3-5.7 0-2.1-.8-4.2-2.3-5.7l-.7-.7c-.8-.8-.8-2 0-2.8.8-.8 2-.8 2.8 0l.7.7c2.3 2.3 3.5 5.3 3.5 8.5s-1.2 6.2-3.5 8.5l-7.1 7.1c-2.3 2.3-5.3 3.5-8.4 3.5z" />';
				break;
			case 'externalLink':
				$view_box = '0 0 48 48';
				$path     = '<path d="M44 2H30c-1.1 0-2 .9-2 2s.9 2 2 2h9.2L24 21.2c-.8.8-.8 2 0 2.8s2 .8 2.8 0L42 8.8V18c0 1.1.9 2 2 2s2-.9 2-2V4c0-1.1-.9-2-2-2z" /><path d="M41 27c-1.1 0-2 .9-2 2v10c0 1.1-.9 2-2 2H9c-1.1 0-2-.9-2-2V11c0-1.1.9-2 2-2h10c1.1 0 2-.9 2-2s-.9-2-2-2H9c-3.3 0-6 2.7-6 6v28c0 3.3 2.7 6 6 6h28c3.3 0 6-2.7 6-6V29c0-1.1-.9-2-2-2z" />';
				break;
			case 'moreArrow':
				$view_box = '0 0 48 48';
				$path     = '<path d="M44 27H4v-3h36.7l-5.8-6.5 2.2-2 8 9z" />';
				break;
			default:
				break;
		}

		$svg = '';
		if ( $path ) {
			$svg_class = 'swl-svg-' . $icon_name;
			if ( $class ) {
				$svg_class .= ' ' . $class;
			}

			$svg = '<svg xmlns="http://www.w3.org/2000/svg" class="' . esc_attr( $svg_class ) . '" width="' . esc_attr( $size ) . '" height="' . esc_attr( $size ) . '" viewBox="' . $view_box . '" role="img" aria-hidden="true" focusable="false">' . $path . '</svg>';
		}

		return $svg;
		// return apply_filters( 'swell_get_svg', $svg, $icon_name, $attrs );
	}
}
